Section 3: Functions/Section 3.tex
% Created 2021-07-30 Fri 13:28
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Mohammed Asir Shahid}
\date{2021-07-30}
\title{Section 3\\\medskip
\large Functions}
\hypersetup{
 pdfauthor={Mohammed Asir Shahid},
 pdftitle={Section 3},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.5)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Pythons Built-In Functions}
\label{sec:org996c585}

Python comes with many built in functions such as print, input, and len which we have already used. Python also comes with Modules known as the Standard Library. For example, we have the Math module containing mathematics functions, the random module containing random number functions, etc. In order to use functions from these modules, we need to import them as follows:

\begin{verbatim}

import random

print(random.randint(1,10))

\end{verbatim}

\begin{verbatim}
3
\end{verbatim}


The above randint function gives us a random number between the given integers.
\end{document}
